<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7298fcd24f5c52afb23172d33b326e8718b3d3ccd0bedca71f3879ba2d5edf0b","plan_job_ref":"Job Test plan target and replace #406 at https://github.com/dflook/terraform-github-actions/actions/runs/7555968661","plan_out_hash":"1e09740a1ec9153e598b3631fcacdaeb0db14149d2070e6459a0071ba0203eef","plan_hash":"10c212d136bb828ad9ecddd531e3c2d6b5e9a880383dae202303723a840c175b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "N2naCwgPGN" -> (known after apply)
!~  foreach = "IGyKfFawdV" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #406](https://github.com/dflook/terraform-github-actions/actions/runs/7555968661)